In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
np.random.randn(6,4)

array([[ 0.48559087, -1.6021127 ,  0.30730857,  0.06276422],
       [ 0.54696247,  0.21211218, -0.34284962, -0.37686232],
       [-1.83349707, -1.02883491,  2.04905481,  0.57101931],
       [ 0.12101742, -0.71736292,  0.23457847, -0.86501158],
       [ 0.34465662, -0.6717568 , -0.3949815 ,  0.8853232 ],
       [ 1.51213568, -1.14356014, -0.37060697, -1.84806398]])

In [21]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.381881  0.560369 -1.546414 -0.187490
2013-01-02  0.330689 -0.516649  2.043846 -1.041329
2013-01-03  0.747286 -0.220721 -1.870669  0.350038
2013-01-04  0.614932  0.621866 -0.355318 -0.343501
2013-01-05 -0.350941 -0.406459  0.116851  0.560815
2013-01-06  0.607538  0.702588  2.147108  0.280048

In [22]:
df.head()

                   A         B         C         D
2013-01-01 -0.381881  0.560369 -1.546414 -0.187490
2013-01-02  0.330689 -0.516649  2.043846 -1.041329
2013-01-03  0.747286 -0.220721 -1.870669  0.350038
2013-01-04  0.614932  0.621866 -0.355318 -0.343501
2013-01-05 -0.350941 -0.406459  0.116851  0.560815

In [23]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [26]:
df.values

array([[-0.38188081,  0.56036927, -1.5464143 , -0.18749049],
       [ 0.33068895, -0.51664856,  2.04384555, -1.04132898],
       [ 0.74728577, -0.22072067, -1.87066901,  0.3500376 ],
       [ 0.61493213,  0.62186582, -0.35531753, -0.3435014 ],
       [-0.35094053, -0.40645934,  0.1168514 ,  0.56081491],
       [ 0.60753824,  0.70258776,  2.14710832,  0.28004778]])

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [28]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.261271  0.123499  0.089234 -0.063570
std    0.504867  0.562797  1.718738  0.588002
min   -0.381881 -0.516649 -1.870669 -1.041329
25%   -0.180533 -0.360025 -1.248640 -0.304499
50%    0.469114  0.169824 -0.119233  0.046279
75%    0.613084  0.606492  1.562097  0.332540
max    0.747286  0.702588  2.147108  0.560815

In [29]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2013-01-06  0.607538  0.702588  2.147108  0.280048
2013-01-04  0.614932  0.621866 -0.355318 -0.343501
2013-01-01 -0.381881  0.560369 -1.546414 -0.187490
2013-01-03  0.747286 -0.220721 -1.870669  0.350038
2013-01-05 -0.350941 -0.406459  0.116851  0.560815
2013-01-02  0.330689 -0.516649  2.043846 -1.041329

In [30]:
df

                   A         B         C         D
2013-01-01 -0.381881  0.560369 -1.546414 -0.187490
2013-01-02  0.330689 -0.516649  2.043846 -1.041329
2013-01-03  0.747286 -0.220721 -1.870669  0.350038
2013-01-04  0.614932  0.621866 -0.355318 -0.343501
2013-01-05 -0.350941 -0.406459  0.116851  0.560815
2013-01-06  0.607538  0.702588  2.147108  0.280048

In [31]:
df['A']

2013-01-01   -0.381881
2013-01-02    0.330689
2013-01-03    0.747286
2013-01-04    0.614932
2013-01-05   -0.350941
2013-01-06    0.607538
Freq: D, Name: A, dtype: float64

In [33]:
df[2:4]

                   A         B         C         D
2013-01-03  0.747286 -0.220721 -1.870669  0.350038
2013-01-04  0.614932  0.621866 -0.355318 -0.343501

In [35]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.330689 -0.516649  2.043846 -1.041329
2013-01-03  0.747286 -0.220721 -1.870669  0.350038
2013-01-04  0.614932  0.621866 -0.355318 -0.343501

In [36]:
df.loc[dates[0]]

A   -0.381881
B    0.560369
C   -1.546414
D   -0.187490
Name: 2013-01-01 00:00:00, dtype: float64

In [37]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.381881  0.560369
2013-01-02  0.330689 -0.516649
2013-01-03  0.747286 -0.220721
2013-01-04  0.614932  0.621866
2013-01-05 -0.350941 -0.406459
2013-01-06  0.607538  0.702588

In [38]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.330689 -0.516649
2013-01-03  0.747286 -0.220721
2013-01-04  0.614932  0.621866

In [39]:
df.loc['20130102',['A','B']]

A    0.330689
B   -0.516649
Name: 2013-01-02 00:00:00, dtype: float64

In [40]:
df.loc[dates[0],'A']

-0.38188080653785267

In [45]:
df.iloc[3]

A    0.614932
B    0.621866
C   -0.355318
D   -0.343501
Name: 2013-01-04 00:00:00, dtype: float64

In [42]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.614932  0.621866
2013-01-05 -0.350941 -0.406459

In [46]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.330689  2.043846
2013-01-03  0.747286 -1.870669
2013-01-05 -0.350941  0.116851

In [47]:
df.iloc[1:3,]

                   A         B         C         D
2013-01-02  0.330689 -0.516649  2.043846 -1.041329
2013-01-03  0.747286 -0.220721 -1.870669  0.350038

In [48]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.560369 -1.546414
2013-01-02 -0.516649  2.043846
2013-01-03 -0.220721 -1.870669
2013-01-04  0.621866 -0.355318
2013-01-05 -0.406459  0.116851
2013-01-06  0.702588  2.147108

In [49]:
df

                   A         B         C         D
2013-01-01 -0.381881  0.560369 -1.546414 -0.187490
2013-01-02  0.330689 -0.516649  2.043846 -1.041329
2013-01-03  0.747286 -0.220721 -1.870669  0.350038
2013-01-04  0.614932  0.621866 -0.355318 -0.343501
2013-01-05 -0.350941 -0.406459  0.116851  0.560815
2013-01-06  0.607538  0.702588  2.147108  0.280048

In [50]:
df[df.A>0]

                   A         B         C         D
2013-01-02  0.330689 -0.516649  2.043846 -1.041329
2013-01-03  0.747286 -0.220721 -1.870669  0.350038
2013-01-04  0.614932  0.621866 -0.355318 -0.343501
2013-01-06  0.607538  0.702588  2.147108  0.280048

In [51]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.560369       NaN       NaN
2013-01-02  0.330689       NaN  2.043846       NaN
2013-01-03  0.747286       NaN       NaN  0.350038
2013-01-04  0.614932  0.621866       NaN       NaN
2013-01-05       NaN       NaN  0.116851  0.560815
2013-01-06  0.607538  0.702588  2.147108  0.280048

In [52]:
df2 = df.copy()

In [54]:
df2['E'] = ['one','two','three','four','five','six']
df2

                   A         B         C         D      E
2013-01-01 -0.381881  0.560369 -1.546414 -0.187490    one
2013-01-02  0.330689 -0.516649  2.043846 -1.041329    two
2013-01-03  0.747286 -0.220721 -1.870669  0.350038  three
2013-01-04  0.614932  0.621866 -0.355318 -0.343501   four
2013-01-05 -0.350941 -0.406459  0.116851  0.560815   five
2013-01-06  0.607538  0.702588  2.147108  0.280048    six

In [56]:
df2['E']

2013-01-01      one
2013-01-02      two
2013-01-03    three
2013-01-04     four
2013-01-05     five
2013-01-06      six
Freq: D, Name: E, dtype: object

In [57]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [59]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.381881  0.560369 -1.546414 -0.187490
2013-01-02 -0.051192  0.043721  0.497431 -1.228819
2013-01-03  0.696094 -0.177000 -1.373238 -0.878782
2013-01-04  1.311026  0.444866 -1.728555 -1.222283
2013-01-05  0.960086  0.038407 -1.611704 -0.661468
2013-01-06  1.567624  0.740994  0.535404 -0.381421

In [60]:
df.apply(lambda x: x.max()-x.min())

A    1.129167
B    1.219236
C    4.017777
D    1.602144
dtype: float64

In [61]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [63]:
df1

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [64]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [65]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [67]:
result = pd.concat([df1,df2,df3])
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [69]:
result = pd.concat([df1,df2,df3], keys=['x','y','z'])
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [70]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [71]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [72]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [73]:
df4 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'], 
                    'D': ['D2', 'D3', 'D6', 'D7'],
                    'F': ['F2', 'F3', 'F6', 'F7']},
                   index=[2, 3, 6, 7])
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [75]:
result = pd.concat([df1,df4],axis=1)
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [79]:
result = pd.concat([df1,df4],axis=1,join='inner')
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [80]:
result = pd.concat([df1,df4],ignore_index=True)
result

c:\users\gus26\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [81]:
left = pd.DataFrame({'key': ['K0', 'K4', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [82]:
left

  key   A   B
0  K0  A0  B0
1  K4  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [83]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [84]:
pd.merge(left,right,on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [85]:
pd.merge(left,right,how='left',on='key')

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K4  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [86]:
pd.merge(left,right,how='right',on='key')

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D1

In [89]:
pd.merge(left,right,how='right',on='key').sort_values(by='key',ascending=True)

  key    A    B   C   D
0  K0   A0   B0  C0  D0
3  K1  NaN  NaN  C1  D1
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3

In [91]:
pd.merge(left,right,how='outer',on='key').sort_values(by='key',ascending=True)

  key    A    B    C    D
0  K0   A0   B0   C0   D0
4  K1  NaN  NaN   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
1  K4   A1   B1  NaN  NaN

In [92]:
pd.merge(left,right,how='inner',on='key').sort_values(by='key',ascending=True)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3